of222/tutorials/rheoEFoam/EKI/Ohmic/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inletNorth
    {
        type            patch;
        nFaces          220;
        startFace       204205;
    }
    inletSouth
    {
        type            patch;
        nFaces          220;
        startFace       204425;
    }
    outlet
    {
        type            patch;
        nFaces          220;
        startFace       204645;
    }
    inletWest
    {
        type            patch;
        nFaces          220;
        startFace       204865;
    }
    frontAndBack
    {
        type            wall;
        nFaces          13000;
        startFace       205085;
    }
    walls
    {
        type            wall;
        nFaces          6710;
        startFace       218085;
    }
)

// ************************************************************************* //
