of222/tutorials/rheoEFoam/EKI/Ohmic/constant/constitutiveProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      constitutiveProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

parameters
{                
                type             Newtonian;

                rho              rho [1 -3 0 0 0 0 0] 1000.;
                eta              eta [1 -1 -1 0 0 0 0] .001;       
}

passiveScalarProperties
{
                solvePassiveScalar   yes;
                D                    D [ 0 2 -1 0 0 0 0 ] 1e-10; 
}

// ************************************************************************* //
