of222/tutorials/rheoEFoam/EKI/Ohmic/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

# Get application directory
application=`getApplication`
 
runApplication blockMesh

cp  0/C.org 0/C

cp  0/sigma.org 0/sigma

runApplication setFields

runApplication $application

